//** @file
//   Strings for H2O Form Dialog DXE
//
//;******************************************************************************
//;* Copyright (c) 2019, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************

/=#

#include "Standard.uni"
#string STR_EFI_SETUP_UTILITY_TITLE     #language en-US        "InsydeH2O Setup Utility"
                                        #language fr-FR        "Logiciel de Configuration d'InsydeH2O"
                                        #language zh-TW        "\wide系微\narrow H2O \wide設定工具\narrow"
                                        #language ja-JP        "InsydeH2O \wideセットアップユーティリティ\narrow"
                                        #language it-IT        "Configuratore InsydeH2O"
                                        #language es-ES        "Utilitario de la programación de InsydeH2O"
                                        #language de-DE        "InsydeH2O-Anbringung"
                                        #language pt-PT        "Configura Utilidade do InsydeH2O"
#string STR_BLANK                       #language en-US        " "
                                        #language fr-FR        " "
                                        #language zh-TW        " "
                                        #language ja-JP        " "
                                        #language it-IT        " "
                                        #language es-ES        " "
                                        #language de-DE        " "
                                        #language pt-PT        " "
#string STR_YES                         #language en-US        "Yes"
                                        #language fr-FR        "Oui"
                                        #language zh-TW        "\wide是\narrow"
                                        #language ja-JP        "\wideはい\narrow"
                                        #language it-IT        "Si"
                                        #language es-ES        "Sí"
                                        #language de-DE        "Ja"
                                        #language pt-PT        "Sim"
#string STR_NO                          #language en-US        "No"
                                        #language fr-FR        "Non"
                                        #language zh-TW        "\wide否\narrow"
                                        #language ja-JP        "\wideいいえ\narrow"
                                        #language it-IT        "No"
                                        #language es-ES        "Sí"
                                        #language de-DE        "Nein"
                                        #language pt-PT        "Não"
#string STR_DISABLED                    #language en-US        "Disabled"
                                        #language fr-FR        "Désactiver"
                                        #language zh-TW        "\wide停用\narrow"
                                        #language ja-JP        "\wide使用しない\narrow"
                                        #language it-IT        "Disabilitato"
                                        #language es-ES        "inhabilitado"
                                        #language de-DE        "Sperren"
                                        #language pt-PT        "Proibir"
#string STR_ENABLED                     #language en-US        "Enabled"
                                        #language fr-FR        "Activer"
                                        #language zh-TW        "\wide啟用\narrow"
                                        #language ja-JP        "\wide使用する\narrow"
                                        #language it-IT        "abilitato"
                                        #language es-ES        "permitido"
                                        #language de-DE        "Aktivieren"
                                        #language pt-PT        "Permitir"
#string STR_AUTO                        #language en-US        "Auto"
                                        #language fr-FR        "Automatique"
                                        #language zh-TW        "\wide自動\narrow"
                                        #language ja-JP        "\wide保存する\narrow"
                                        #language it-IT        "Auto"
                                        #language es-ES        "Auto"
                                        #language de-DE        "Automatisch"
                                        #language pt-PT        "Auto"
#string STR_OK                          #language en-US        "OK"
#string STR_CANCEL                      #language en-US        "CANCEL"

#string STR_FORMSET_TITLE_CHECKBOX      #language en-US        "H2O Form Dialog for Question Type Checkbox"
#string STR_FORMSET_TITLE_DATE          #language en-US        "H2O Form Dialog for Question Type Date"
#string STR_FORMSET_TITLE_ONE_OF        #language en-US        "H2O Form Dialog for Question Type One Of"
#string STR_FORMSET_TITLE_ORDERED_LIST  #language en-US        "H2O Form Dialog for Question Type Ordered List"
#string STR_FORMSET_TITLE_NUMERIC       #language en-US        "H2O Form Dialog for Question Type Numeric"
#string STR_FORMSET_TITLE_PASSWORD      #language en-US        "H2O Form Dialog for Question Type Password"
#string STR_FORMSET_TITLE_STRING        #language en-US        "H2O Form Dialog for Question Type String"
#string STR_FORMSET_TITLE_TIME          #language en-US        "H2O Form Dialog for Question Type Time"

#string STR_STR_H2O_FORM_DIALOG_TITLE   #language en-US        "H2O Form Dialog for Question"